In [1]:
%load_ext sql

In [2]:
import sqlalchemy
import pandas as pd
import numpy as np
from sqlalchemy import create_engine

In [3]:
engine = sqlalchemy.create_engine('postgresql://postgres:Lunex!@localhost:5433/COPD_Project')

In [4]:
%sql $engine.url

In [5]:
# Create the coal dataframe
file_path = "./Resources/processed_Coal_Mines.csv"
coal_df = pd.read_csv(file_path)
coal_df.head()

,State_County,State,County,Surface_Mines,Underground_Mines
0,"Pennsylvania, Clearfield",Alabama,Walker,22,2.0
1,"Pennsylvania, Schuylkill",Alabama,Jefferson,22,5.0
2,"Pennsylvania, Somerset",Alabama,Jefferson,13,5.0
3,"West Virginia, Mcdowell",Alabama,Tuscaloosa,13,12.0
4,"Kentucky, Pike",Alabama,Jefferson,13,14.0

In [6]:
coal_df = coal_df.set_index(['State_County','State', 'County'])
coal_df.head()

                                             Surface_Mines  Underground_Mines
State_County             State   County
Pennsylvania, Clearfield Alabama Walker                 22                2.0
Pennsylvania, Schuylkill Alabama Jefferson              22                5.0
Pennsylvania, Somerset   Alabama Jefferson              13                5.0
West Virginia, Mcdowell  Alabama Tuscaloosa             13               12.0
Kentucky, Pike           Alabama Jefferson              13               14.0

In [ ]:
# Push coal df to db
coal_df.to_sql('coal_mines', con = engine, if_exists = 'append', chunksize = 1000)

In [ ]:
# create coal df from db 
coal_sql_df = pd.read_sql_query("SELECT * from coal_mines", engine)
coal_sql_df.head()

In [ ]:
# using sql commands to create df
%sql SELECT * FROM coal_mines

In [7]:
# Create the air_quality dataframe
file_path = "./Resources/processed_Decade_Air_Quality.csv"
air_quality_df = pd.read_csv(file_path)
air_quality_df.head()

,State_County,State,County,Days_with_AQI,Good_Days,Moderate_Days,Unhealthy_for_Sensitive_Groups_Days,Unhealthy_Days,Very_Unhealthy_Days,Hazardous_Days
0,"Alabama, Baldwin",Alabama,Baldwin,523.0,455.0,66.0,2.0,0.0,0.0,0.0
1,"Alabama, Clay",Alabama,Clay,226.0,194.0,32.0,0.0,0.0,0.0,0.0
2,"Alabama, Colbert",Alabama,Colbert,586.0,472.0,114.0,0.0,0.0,0.0,0.0
3,"Alabama, DeKalb",Alabama,DeKalb,724.0,635.0,89.0,0.0,0.0,0.0,0.0
4,"Alabama, Elmore",Alabama,Elmore,472.0,436.0,36.0,0.0,0.0,0.0,0.0

In [8]:
air_quality_df = air_quality_df.set_index(['State_County','State', 'County'])
air_quality_df.head()

,,,Days_with_AQI,Good_Days,Moderate_Days,Unhealthy_for_Sensitive_Groups_Days,Unhealthy_Days,Very_Unhealthy_Days,Hazardous_Days
State_County,State,County,,,,,,,
"Alabama, Baldwin",Alabama,Baldwin,523.0,455.0,66.0,2.0,0.0,0.0,0.0
"Alabama, Clay",Alabama,Clay,226.0,194.0,32.0,0.0,0.0,0.0,0.0
"Alabama, Colbert",Alabama,Colbert,586.0,472.0,114.0,0.0,0.0,0.0,0.0
"Alabama, DeKalb",Alabama,DeKalb,724.0,635.0,89.0,0.0,0.0,0.0,0.0
"Alabama, Elmore",Alabama,Elmore,472.0,436.0,36.0,0.0,0.0,0.0,0.0

In [ ]:
# Push air quality df to db
air_quality_df.to_sql('air_quality_data', con = engine, if_exists = 'append', chunksize = 1000)

In [ ]:
# create air quality df from SQL db
sql_air_quality_df = pd.read_sql_query("SELECT * from air_quality_data", engine)
sql_air_quality_df.head()

In [ ]:
%sql SELECT * FROM air_quality_data

In [9]:
# Create the census dataframe
file_path = "./Resources/processed_PLACES_COPD.csv"
places_df = pd.read_csv(file_path)
places_df.head()

,State_County,State,County,Levels_Smokers,Levels_COPD
0,"Cass, Iowa",Iowa,Cass,19.3,8.3
1,"Monona, Iowa",Iowa,Monona,18.5,8.3
2,"Dillingham, Alaska",Alaska,Dillingham,31.1,8.9
3,"Custer, Colorado",Colorado,Custer,13.8,7.5
4,"Ketchikan Gateway, Alaska",Alaska,Ketchikan Gateway,19.4,6.6

In [10]:
places_df = places_df.set_index(['State_County','State', 'County'])
places_df.head()

,,,Levels_Smokers,Levels_COPD
State_County,State,County,,
"Cass, Iowa",Iowa,Cass,19.3,8.3
"Monona, Iowa",Iowa,Monona,18.5,8.3
"Dillingham, Alaska",Alaska,Dillingham,31.1,8.9
"Custer, Colorado",Colorado,Custer,13.8,7.5
"Ketchikan Gateway, Alaska",Alaska,Ketchikan Gateway,19.4,6.6

In [ ]:
# Push air quality df to db
places_df.to_sql('places_data', con = engine, if_exists = 'append', chunksize = 1000)

In [ ]:
# create places_data df from SQL db
places_sql_df = pd.read_sql_query("SELECT * from places_data", engine)
places_sql_df.head()

In [ ]:
# Create the census dataframe
file_path = "./Resources/processed_census_data.csv"
census_df = pd.read_csv(file_path)
census_df.head()

In [ ]:
census_df.shape

In [ ]:
# Show all columns as list
# Dataframe show all columns sorted list
len(census_df.columns)

In [ ]:
print(census_df.info())

# Creating different dataframes for age groups 0-18 (so that they fit in db)
## - Start by setting first three columns as index

In [ ]:
census_df = census_df.set_index(['State_County','State', 'County'])
census_df.head()

In [ ]:
# group 0
df0 = census_df.iloc[:,0:72]
df0

In [ ]:
# group 1
df1 = census_df.iloc[:, 72:144]
df1

In [ ]:
# group2
df2 = census_df.iloc[:, 144:216]
df2

In [ ]:
#group 3
df3 = census_df.iloc[:, 216:288]
df3
# 72

In [ ]:
# group 4
df4 = census_df.iloc[:, 288:360]
df4
# 72

In [ ]:
# group5
df5 = census_df.iloc[:, 360:432]
df5
# 72

In [ ]:
# group6
df6 = census_df.iloc[:, 432:504]
df6
# 72

In [ ]:
# group7
df7 = census_df.iloc[:, 504:576]
df7
# 72

In [ ]:
# group8
df8 = census_df.iloc[:, 576:648]
df8
# 72

In [ ]:
# group9
df9 = census_df.iloc[:, 648:720]
df9
# 72

In [ ]:
# group10
df10 = census_df.iloc[:, 720:792]
df10
# 72

In [ ]:
# group11
df11 = census_df.iloc[:, 792:864]
df11
# 72

In [ ]:
# group12
df12 = census_df.iloc[:, 864:936]
df12
# 72

In [ ]:
# group13
df13 = census_df.iloc[:, 936:1008]
df13
# 72

In [ ]:
# group14
df14 = census_df.iloc[:, 1008:1080]
df14
# 72

In [ ]:
# group15
df15 = census_df.iloc[:, 1080:1152]
df15
# 72

In [ ]:
# group16
df16 = census_df.iloc[:, 1152:1224]
df16
# 72

In [ ]:
# group17
df17 = census_df.iloc[:, 1224:1296]
df17
# 72

In [ ]:
# group18
df18 = census_df.iloc[:, 1296:1368]
df18
# 72

In [ ]:
# # Create dataframe
# data=pd.DataFrame({
#     'book_id':[12345,12346,12347],
#     'title':['Python Programming','Learn MySQL','Data Science Cookbook'],
#     'price':[29,23,27]
# })

# data

# # Insert whole DataFrame into MySQL
# data.to_sql('book_details', con = engine, if_exists = 'append', chunksize = 1000)

# Pushing new df (age group) into db

In [ ]:
df0.to_sql('census_data_0', con = engine, if_exists = 'append', chunksize = 1000)

In [ ]:
df1.to_sql('census_data_1', con = engine, if_exists = 'append', chunksize = 1000)

In [ ]:
df2.to_sql('census_data_2', con = engine, if_exists = 'append', chunksize = 1000)

In [ ]:
df3.to_sql('census_data_3', con = engine, if_exists = 'append', chunksize = 1000)

In [ ]:
df4.to_sql('census_data_4', con = engine, if_exists = 'append', chunksize = 1000)

In [ ]:
df5.to_sql('census_data_5', con = engine, if_exists = 'append', chunksize = 1000)

In [ ]:
df6.to_sql('census_data_6', con = engine, if_exists = 'append', chunksize = 1000)

In [ ]:
df7.to_sql('census_data_7', con = engine, if_exists = 'append', chunksize = 1000)

In [ ]:
df8.to_sql('census_data_8', con = engine, if_exists = 'append', chunksize = 1000)

In [ ]:
df9.to_sql('census_data_9', con = engine, if_exists = 'append', chunksize = 1000)

In [ ]:
df10.to_sql('census_data_10', con = engine, if_exists = 'append', chunksize = 1000)

In [ ]:
df11.to_sql('census_data_11', con = engine, if_exists = 'append', chunksize = 1000)

In [ ]:
df12.to_sql('census_data_12', con = engine, if_exists = 'append', chunksize = 1000)

In [ ]:
df13.to_sql('census_data_13', con = engine, if_exists = 'append', chunksize = 1000)

In [ ]:
df14.to_sql('census_data_14', con = engine, if_exists = 'append', chunksize = 1000)

In [ ]:
df15.to_sql('census_data_15', con = engine, if_exists = 'append', chunksize = 1000)

In [ ]:
df16.to_sql('census_data_16', con = engine, if_exists = 'append', chunksize = 1000)

In [ ]:
df17.to_sql('census_data_17', con = engine, if_exists = 'append', chunksize = 1000)

In [ ]:
df18.to_sql('census_data_18', con = engine, if_exists = 'append', chunksize = 1000)

# Example of creating age-group dataframe directly from Database

In [ ]:
census_data_0 = pd.read_sql_query("SELECT * from census_data_0", engine)
census_data_0.head()

# ML Table

In [12]:
new_df = pd.concat([coal_df, places_df], axis=1)
new_df.head()

,,,Surface_Mines,Underground_Mines,Levels_Smokers,Levels_COPD
State_County,State,County,,,,
"Pennsylvania, Clearfield",Alabama,Walker,22.0,2.0,NaN,NaN
"Pennsylvania, Schuylkill",Alabama,Jefferson,22.0,5.0,NaN,NaN
"Pennsylvania, Somerset",Alabama,Jefferson,13.0,5.0,NaN,NaN
"West Virginia, Mcdowell",Alabama,Tuscaloosa,13.0,12.0,NaN,NaN
"Kentucky, Pike",Alabama,Jefferson,13.0,14.0,NaN,NaN